# CannotConstrainBasePointAlignments Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..CannotConstrainBasePointAlignments Property
BuiltInFailures..::..DimensionFailures Class See Also
---
Alignments to base points cannot be constrained.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotConstrainBasePointAlignments { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotConstrainBasePointAlignments As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotConstrainBasePointAlignments {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace